In [1]:
import numpy as np
import pandas as pd

In [4]:
df = pd.DataFrame(np.random.randn(8, 3), columns=['A', 'B', 'C'])
df.columns = [x.lower() for x in df.columns]
df

          a         b         c
0 -0.864993  1.884684 -0.859144
1 -0.439802  1.555766  0.208855
2 -0.269182 -2.104882 -0.979790
3 -1.057895 -0.513125  0.911283
4  1.208602  0.602442 -0.521669
5  1.199188 -1.055801  0.564256
6  0.711737 -1.248697  0.941158
7  1.255393  0.461813 -1.329460

In [5]:
df.a.array

<PandasArray>
[-0.8649932679322414, -0.4398022876632434, -0.2691824519270215,
 -1.0578954368525526,  1.2086024223417124,  1.1991875644372076,
  0.7117368838499414,  1.2553930786896286]
Length: 8, dtype: float64

In [6]:
data = np.random.randint(0, 7, size=50)
data

array([4, 0, 5, 2, 1, 5, 0, 2, 2, 4, 5, 1, 1, 4, 0, 6, 0, 2, 3, 2, 3, 1,
       1, 1, 2, 2, 0, 0, 5, 6, 5, 4, 2, 6, 6, 5, 5, 5, 0, 2, 5, 0, 6, 1,
       3, 1, 0, 6, 4, 2])

In [7]:
s = pd.Series(data)
s.value_counts()

2    10
5     9
0     9
1     8
6     6
4     5
3     3
dtype: int64

In [9]:
s5 = pd.Series([1,1,3,3,3,5,5,7,7,7])
s5.mode()

0    3
1    7
dtype: int64

In [14]:
df5 = pd.DataFrame({"A": np.random.randint(0,7, size = 50),
                    "B": np.random.randint(-10, 15, size=50)})
df5.mode()

     A  B
0  3.0 -7
1  NaN -2
2  NaN  7

In [15]:
s = pd.Series(np.random.randn(5), index=['a', 'b','c','d','e'])
s

a    0.184700
b    0.751889
c   -0.888517
d    0.936636
e    0.583595
dtype: float64

In [16]:
s.reindex(['e','b', 'f', 'd'])

e    0.583595
b    0.751889
f         NaN
d    0.936636
dtype: float64

In [38]:
df = pd.DataFrame({
    'one': pd.Series(np.random.randn(3), index=['a', 'b', 'c']),
    'two': pd.Series(np.random.randn(4), index=['a','b','c','d']),
    'three': pd.Series(np.random.randn(3), index=['b','c','d'])})
df

        one       two     three
a  0.292454  1.163421       NaN
b  0.294039  0.108742 -0.106265
c  0.089039  1.393048  0.572400
d       NaN -0.657224  0.718206

In [18]:
df.reindex(index=['c','f','b'], columns=['three','two','one'])

      three       two       one
c -0.585171  0.630739  0.118537
f       NaN       NaN       NaN
b  2.391693  0.352180 -0.208492

In [22]:
df.reindex(['c','f','b'], axis='index')

        one       two     three
c  0.118537  0.630739 -0.585171
f       NaN       NaN       NaN
b -0.208492  0.352180  2.391693

In [23]:
df

        one       two     three
a  0.084786  0.739315       NaN
b -0.208492  0.352180  2.391693
c  0.118537  0.630739 -0.585171
d       NaN -1.210769  0.284981

In [24]:
df.drop(['a','d'], axis=0)

        one       two     three
b -0.208492  0.352180  2.391693
c  0.118537  0.630739 -0.585171

In [25]:
df.drop(['one'], axis=1)

        two     three
a  0.739315       NaN
b  0.352180  2.391693
c  0.630739 -0.585171
d -1.210769  0.284981

In [26]:
s

a    0.184700
b    0.751889
c   -0.888517
d    0.936636
e    0.583595
dtype: float64

In [27]:
s.rename(str.upper)

A    0.184700
B    0.751889
C   -0.888517
D    0.936636
E    0.583595
dtype: float64

In [28]:
s

a    0.184700
b    0.751889
c   -0.888517
d    0.936636
e    0.583595
dtype: float64

In [29]:
df.rename(columns={'one':'foo', 'two':'bar'}, 
          index={'a':'apple','b':'banana','d':'durian'})

             foo       bar     three
apple   0.084786  0.739315       NaN
banana -0.208492  0.352180  2.391693
c       0.118537  0.630739 -0.585171
durian       NaN -1.210769  0.284981

In [ ]:
df.rename({'one':'foo','two':'bar'}, axis='columns')
df.rename({'a':'apple','b':'banana','d':'durian'}, axis='index')

In [30]:
# Datetime
s = pd.Series(pd.date_range('20130101 09:10:12', periods=4))
s

0   2013-01-01 09:10:12
1   2013-01-02 09:10:12
2   2013-01-03 09:10:12
3   2013-01-04 09:10:12
dtype: datetime64[ns]

In [32]:
print(s.dt.second, s.dt.day, s.dt.dayofweek)

0    12
1    12
2    12
3    12
dtype: int64 0    1
1    2
2    3
3    4
dtype: int64 0    1
1    2
2    3
3    4
dtype: int64

In [33]:
stz = s.dt.tz_localize('US/Eastern')
stz

0   2013-01-01 09:10:12-05:00
1   2013-01-02 09:10:12-05:00
2   2013-01-03 09:10:12-05:00
3   2013-01-04 09:10:12-05:00
dtype: datetime64[ns, US/Eastern]

In [34]:
stz.dt.tz

In [35]:
s.dt.tz_localize('UTC').dt.tz_convert('US/Eastern')

0   2013-01-01 04:10:12-05:00
1   2013-01-02 04:10:12-05:00
2   2013-01-03 04:10:12-05:00
3   2013-01-04 04:10:12-05:00
dtype: datetime64[ns, US/Eastern]

In [36]:
s=pd.Series(['A','B','C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'], dtype='string')
s

0       A
1       B
2       C
3    Aaba
4    Baca
5    <NA>
6    CABA
7     dog
8     cat
dtype: string

In [37]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5    <NA>
6    caba
7     dog
8     cat
dtype: string

In [39]:
df

        one       two     three
a  0.292454  1.163421       NaN
b  0.294039  0.108742 -0.106265
c  0.089039  1.393048  0.572400
d       NaN -0.657224  0.718206

In [41]:
unsorted_df = df.reindex(index=['a','d','c','b'],
                          columns=['three','two','one'])
unsorted_df

      three       two       one
a       NaN  1.163421  0.292454
d  0.718206 -0.657224       NaN
c  0.572400  1.393048  0.089039
b -0.106265  0.108742  0.294039

In [42]:
# Sort DataFrame by index
unsorted_df.sort_index()

      three       two       one
a       NaN  1.163421  0.292454
b -0.106265  0.108742  0.294039
c  0.572400  1.393048  0.089039
d  0.718206 -0.657224       NaN

In [43]:
# Sort DataFrame by index
unsorted_df.sort_index(ascending=False)

      three       two       one
d  0.718206 -0.657224       NaN
c  0.572400  1.393048  0.089039
b -0.106265  0.108742  0.294039
a       NaN  1.163421  0.292454

In [44]:
# Sort DataFrame by column name
unsorted_df.sort_index(axis=1)

        one     three       two
a  0.292454       NaN  1.163421
d       NaN  0.718206 -0.657224
c  0.089039  0.572400  1.393048
b  0.294039 -0.106265  0.108742

In [45]:
# Sort Series by index
unsorted_df['three'].sort_index()

a         NaN
b   -0.106265
c    0.572400
d    0.718206
Name: three, dtype: float64

In [47]:
df1 = pd.DataFrame({'one':[2,1,1,1], 'two':[1,3,2,4], 'three':[5,4,3,2]})
df1

   one  two  three
0    2    1      5
1    1    3      4
2    1    2      3
3    1    4      2

In [48]:
# Sort DataFrame by column 'two'
df1.sort_values(by='two')

   one  two  three
0    2    1      5
2    1    2      3
1    1    3      4
3    1    4      2

In [49]:
# Sort DataFrame by columns 'one' and 'two'
df1[['one','two','three']].sort_values(by=['one','two'])

   one  two  three
2    1    2      3
1    1    3      4
3    1    4      2
0    2    1      5

In [52]:
s[2] = np.nan
s.sort_values()

0       A
3    Aaba
1       B
4    Baca
6    CABA
8     cat
7     dog
2    <NA>
5    <NA>
dtype: string

In [53]:
s.sort_values(na_position='first')

2    <NA>
5    <NA>
0       A
3    Aaba
1       B
4    Baca
6    CABA
8     cat
7     dog
dtype: string

In [56]:
# Build MultiIndex

idx = pd.MultiIndex.from_tuples([('a',1), ('a',2), ('a',2), ('b',2),('b',1),('b',1)])
idx

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 2),
            ('b', 2),
            ('b', 1),
            ('b', 1)],
           )

In [58]:
idx.names = ['first','second']
idx

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 2),
            ('b', 2),
            ('b', 1),
            ('b', 1)],
           names=['first', 'second'])

In [59]:
# Build DataFrame
df_multi = pd.DataFrame({'A': np.arange(6,0,-1)}, index=idx)
df_multi

              A
first second
a     1       6
      2       5
      2       4
b     2       3
      1       2
      1       1

In [61]:
# Sort DataFrame by 'second' (index) and 'A' (column)
df_multi.sort_values(by=['second', 'A'])

              A
first second
b     1       1
      1       2
a     1       6
b     2       3
a     2       4
      2       5